// src/components/Intro.tsx
import React from 'react';
import './PasswordIntro.css';

const PasswordIntro: React.FC = () => {
    return (
        <section className="intro-container">
            <h2><strong>Ласкаво просимо на наш сервіс генерації паролів!</strong></h2>
            <br></br>
            <p>
        Цей сайт створений командою студентів 3 курсу НТУ «ХПІ» з метою допомогти користувачам
        легко створювати надійні паролі та перевіряти безпечність вже існуючих. Ми розуміємо,
        наскільки важливо захищати особисту інформацію в цифрову епоху, тому розробили інструмент,
        який поєднує простоту у використанні та високий рівень безпеки.
            </p>
            <ul>
                <li className="no-marker">На нашому сайті ви зможете:</li>
                <li>🔐 <strong>Згенерувати надійний пароль</strong> за власними критеріями (довжина, наявність символів, цифр тощо);</li>
                <li>🛡️ <strong>Перевірити свій пароль</strong> на стійкість до зламів.</li>
            </ul>
            <br></br>
            <p>
                <i>Забезпечте свій цифровий захист вже зараз — це просто, швидко й ефективно!</i>
            </p>
        </section>
    );
};

export default PasswordIntro;
